Ac6Embedded/svd-microchip/PIC32CM_PL/PIC32CM6408PL10028.svd
            <register>
               <name>WINCTRL</name>
               <description>Window Control</description>
               <addressOffset>0x1C</addressOffset>
               <fields>
                  <field>
                     <name>WINMODE</name>
                     <description>Window Comparator Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WINMODESelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Window Comparison</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BELOW</name>
                           <description>OUTPUT 'less than' WINLT</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ABOVE</name>
                           <description>OUTPUT 'greater than' WINHT</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INSIDE</name>
                           <description>WINLT 'less than' OUTPUT 'less than' WINHT</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OUTSIDE</name>
                           <description>OUTPUT 'less than' WINLT or OUTPUT 'greater than'WINHT</description>
                           <value>0x4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WINSRC</name>
                     <description>Window Mode Source</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>WINSRCSelect</name>
                        <enumeratedValue>
                           <name>RESULT</name>
                           <description>Use RESULT[15:0] as Window Comparator source</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SAMPLE</name>
                           <description>Use SAMPLE[15:0] as Window Comparator source</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WINLT</name>
               <description>Window Low Threshold</description>
               <addressOffset>0x20</addressOffset>
               <fields>
                  <field>
                     <name>WINLT</name>
                     <description>Window Low Threshold</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WINHT</name>
               <description>Window High Threshold</description>
               <addressOffset>0x24</addressOffset>
               <fields>
                  <field>
                     <name>WINHT</name>
                     <description>Window High Threshold</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INPUTCTRL</name>
               <description>Input Multiplexer Control</description>
               <addressOffset>0x28</addressOffset>
               <fields>
                  <field>
                     <name>MUXNEG</name>
                     <description>Negative Input Multiplexer</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>MUXNEGSelect</name>
                        <enumeratedValue>
                           <name>AIN2</name>
                           <description>ADC AIN2 Pin</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN3</name>
                           <description>ADC AIN3 Pin</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN4</name>
                           <description>ADC AIN4 Pin</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN5</name>
                           <description>ADC AIN5 Pin</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN6</name>
                           <description>ADC AIN6 Pin</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN7</name>
                           <description>ADC AIN7 Pin</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN16</name>
                           <description>ADC AIN16 Pin</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN17</name>
                           <description>ADC AIN17 Pin</description>
                           <value>0x11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN18</name>
                           <description>ADC AIN18 Pin</description>
                           <value>0x12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN19</name>
                           <description>ADC AIN19 Pin</description>
                           <value>0x13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN20</name>
                           <description>ADC AIN20 Pin</description>
                           <value>0x14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN21</name>
                           <description>ADC AIN21 Pin</description>
                           <value>0x15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN22</name>
                           <description>ADC AIN22 Pin</description>
                           <value>0x16</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN23</name>
                           <description>ADC AIN23 Pin</description>
                           <value>0x17</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN24</name>
                           <description>ADC AIN24 Pin</description>
                           <value>0x18</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN25</name>
                           <description>ADC AIN25 Pin</description>
                           <value>0x19</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN26</name>
                           <description>ADC AIN26 Pin</description>
                           <value>0x1A</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN27</name>
                           <description>ADC AIN27 Pin</description>
                           <value>0x1B</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN28</name>
                           <description>ADC AIN28 Pin</description>
                           <value>0x1C</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN29</name>
                           <description>ADC AIN29 Pin</description>
                           <value>0x1D</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN31</name>
                           <description>ADC AIN31 Pin</description>
                           <value>0x1F</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN40</name>
                           <description>ADC AIN40 Pin</description>
                           <value>0x28</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN41</name>
                           <description>ADC AIN41 Pin</description>
                           <value>0x29</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN42</name>
                           <description>ADC AIN42 Pin</description>
                           <value>0x2A</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN43</name>
                           <description>ADC AIN43 Pin</description>
                           <value>0x2B</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN44</name>
                           <description>ADC AIN44 Pin</description>
                           <value>0x2C</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN45</name>
                           <description>ADC AIN45 Pin</description>
                           <value>0x2D</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN46</name>
                           <description>ADC AIN46 Pin</description>
                           <value>0x2E</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN47</name>
                           <description>ADC AIN47 Pin</description>
                           <value>0x2F</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GND</name>
                           <description>Analog Ground</description>
                           <value>0x60</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VREFP</name>
                           <description>Positive Reference</description>
                           <value>0x61</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MUXPOS</name>
                     <description>Positive Input Multiplexer</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>7</bitWidth>
                     <writeConstraint>
                        <useEnumeratedValues>true</useEnumeratedValues>
                     </writeConstraint>
                     <enumeratedValues>
                        <name>MUXPOSSelect</name>
                        <enumeratedValue>
                           <name>AIN2</name>
                           <description>ADC AIN2 Pin</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN3</name>
                           <description>ADC AIN3 Pin</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN4</name>
                           <description>ADC AIN4 Pin</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN5</name>
                           <description>ADC AIN5 Pin</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN6</name>
                           <description>ADC AIN6 Pin</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN7</name>
                           <description>ADC AIN7 Pin</description>
                           <value>0x7</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN16</name>
                           <description>ADC AIN16 Pin</description>
                           <value>0x10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN17</name>
                           <description>ADC AIN17 Pin</description>
                           <value>0x11</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN18</name>
                           <description>ADC AIN18 Pin</description>
                           <value>0x12</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN19</name>
                           <description>ADC AIN19 Pin</description>
                           <value>0x13</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN20</name>
                           <description>ADC AIN20 Pin</description>
                           <value>0x14</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN21</name>
                           <description>ADC AIN21 Pin</description>
                           <value>0x15</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN22</name>
                           <description>ADC AIN22 Pin</description>
                           <value>0x16</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN23</name>
                           <description>ADC AIN23 Pin</description>
                           <value>0x17</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN24</name>
                           <description>ADC AIN24 Pin</description>
                           <value>0x18</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN25</name>
                           <description>ADC AIN25 Pin</description>
                           <value>0x19</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN26</name>
                           <description>ADC AIN26 Pin</description>
                           <value>0x1A</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN27</name>
                           <description>ADC AIN27 Pin</description>
                           <value>0x1B</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN28</name>
                           <description>ADC AIN28 Pin</description>
                           <value>0x1C</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN29</name>
                           <description>ADC AIN29 Pin</description>
                           <value>0x1D</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN31</name>
                           <description>ADC AIN31 Pin</description>
                           <value>0x1F</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN40</name>
                           <description>ADC AIN40 Pin</description>
                           <value>0x28</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN41</name>
                           <description>ADC AIN41 Pin</description>
                           <value>0x29</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN42</name>
                           <description>ADC AIN42 Pin</description>
                           <value>0x2A</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN43</name>
                           <description>ADC AIN43 Pin</description>
                           <value>0x2B</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN44</name>
                           <description>ADC AIN44 Pin</description>
                           <value>0x2C</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN45</name>
                           <description>ADC AIN45 Pin</description>
                           <value>0x2D</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN46</name>
                           <description>ADC AIN46 Pin</description>
                           <value>0x2E</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>AIN47</name>
                           <description>ADC AIN47 Pin</description>
                           <value>0x2F</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GND</name>
                           <description>Analog Ground</description>
                           <value>0x60</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VDDCOREDIV4</name>
                           <description>1/4 Scaled Core Supply</description>
                           <value>0x61</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TEMPSENSE</name>
                           <description>Temperature Sensor</description>
                           <value>0x62</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VDDIODIV10</name>
                           <description>1/10 Scaled VDDIO Supply</description>
                           <value>0x64</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>VDDIO2DIV10</name>
                           <description>1/10 Scaled VDDIO2 Supply</description>
                           <value>0x65</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACVREFSCALE0</name>
                           <description>Output from AC VREFSCALE0</description>
                           <value>0x69</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ACVREFSCALE1</name>
                           <description>Output from AC VREFSCALE1</description>
                           <value>0x6A</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TESTBUF</name>
                           <description>Test Buffer</description>
                           <value>0x70</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>PTC</name>
                           <description>PTC</description>
                           <value>0x7E</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
